// Задача 12. Написать программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно 1, то программа выводит остаток от деления.

Console .Clear();

Console.Write("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());

if (a % b ==0)
  Console.Write("Число 2 кратно числу 1");
else
Console.Write($"Число 2 не кратно числу 1. Остаток от деления ={a % b}");
